## Loading Data

In [15]:
import pandas as pd

file = "C:/Users/AGrze/Documents/Tableau/getting_started_data_sets/Global Superstore Returns 2016.csv"
df = pd.read_csv(file)

In [48]:
# df = pd.read if I press tab after this, I will see available options
# of what can be loaded apart from csv

In [3]:
df

     Returned                  Order ID           Region
0         Yes  CA-2012-SA20830140-41210       Central US
1         Yes  IN-2012-PB19210127-41259     Eastern Asia
2         Yes  CA-2012-SC20095140-41174       Central US
3         Yes    IN-2015-JH158207-42140          Oceania
4         Yes    IN-2014-LC168857-41747          Oceania
...       ...                       ...              ...
1074      Yes   IN-2014-DA1345058-41769    Southern Asia
1075      Yes  US-2013-HG14845140-41530       Eastern US
1076      Yes   US-2013-SJ2021582-41543  Central America
1077      Yes  CA-2015-EB13870140-42269       Eastern US
1078      Yes    EG-2014-PM894038-41846     North Africa

[1079 rows x 3 columns]

## Basic Operations

### Viewing the first and last 5 rows

In [4]:
df.head()

  Returned                  Order ID        Region
0      Yes  CA-2012-SA20830140-41210    Central US
1      Yes  IN-2012-PB19210127-41259  Eastern Asia
2      Yes  CA-2012-SC20095140-41174    Central US
3      Yes    IN-2015-JH158207-42140       Oceania
4      Yes    IN-2014-LC168857-41747       Oceania

In [5]:
df.tail()

     Returned                  Order ID           Region
1074      Yes   IN-2014-DA1345058-41769    Southern Asia
1075      Yes  US-2013-HG14845140-41530       Eastern US
1076      Yes   US-2013-SJ2021582-41543  Central America
1077      Yes  CA-2015-EB13870140-42269       Eastern US
1078      Yes    EG-2014-PM894038-41846     North Africa

### Check the column data types

In [6]:
df.dtypes
#(type of data in columns, object - string, float's, int's...)

Returned    object
Order ID    object
Region      object
dtype: object

In [8]:
df.shape
#(number of rows, number of columns)

(1079, 3)

In [9]:
df.info()
# The info method gives the column datatypes+ number of non-null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1079 entries, 0 to 1078
Data columns (total 3 columns):
Returned    1079 non-null object
Order ID    1079 non-null object
Region      1079 non-null object
dtypes: object(3)
memory usage: 25.4+ KB

## Slicing

Selecting specific columns or rows but not specifying the value we want in those columns or rows

### Select columns using brackets
With square brackets, you can select one or more columns

In [10]:
# Select one column using double brackets
df[['Returned']].head()

  Returned
0      Yes
1      Yes
2      Yes
3      Yes
4      Yes

In [11]:
# Select multiple columns using double brackets
df[['Returned', 'Order ID']].head()

  Returned                  Order ID
0      Yes  CA-2012-SA20830140-41210
1      Yes  IN-2012-PB19210127-41259
2      Yes  CA-2012-SC20095140-41174
3      Yes    IN-2015-JH158207-42140
4      Yes    IN-2014-LC168857-41747

In [12]:
# When I select columns it's still a Pandas DataFrame:
type(df[['Returned']].head())

pandas.core.frame.DataFrame

In [14]:
# To produce a pandas series, use only one bracket - but then
# multiple columns can't be selected
df['Returned'].head()

0    Yes
1    Yes
2    Yes
3    Yes
4    Yes
Name: Returned, dtype: object

### Pandas Slicing

With a pandas series, we can select rows using slicing like this: series[start_index:end_index]

The end_index is not inclusive. This behaviour is very similar to Python lists.

In [16]:
df['Returned']

0       Yes
1       Yes
2       Yes
3       Yes
4       Yes
       ...
1074    Yes
1075    Yes
1076    Yes
1077    Yes
1078    Yes
Name: Returned, Length: 1079, dtype: object

In [17]:
df['Returned'][4:15]

4     Yes
5     Yes
6     Yes
7     Yes
8     Yes
9     Yes
10    Yes
11    Yes
12    Yes
13    Yes
14    Yes
Name: Returned, dtype: object

In [18]:
# Select one column using dot notation. This is not recommended
df.Returned.head()

0    Yes
1    Yes
2    Yes
3    Yes
4    Yes
Name: Returned, dtype: object

In [19]:
# When column name has spaces dot notation will not work.

### Selecting Columns using loc

The pandas attribute .loc allows you to select columns, index, and slice your data.

In [20]:
df.loc[:, ['Returned']].head()

  Returned
0      Yes
1      Yes
2      Yes
3      Yes
4      Yes

In [21]:
df.loc[5:10, ['Returned']]

   Returned
5       Yes
6       Yes
7       Yes
8       Yes
9       Yes
10      Yes

## Filtering Data

It's like a SQL query where you specify what value you wanna find, for ex specific order IDs or only returned objects etc.

| Comparison Operator | Meaning |
| ------------------- | ------- |
| < | less than |
| <= | less than or equal to |
| > | greater than |
| >= | greater than or equal to |
| == | equal |
| != | not equal |

In [22]:
df.head()

  Returned                  Order ID        Region
0      Yes  CA-2012-SA20830140-41210    Central US
1      Yes  IN-2012-PB19210127-41259  Eastern Asia
2      Yes  CA-2012-SC20095140-41174    Central US
3      Yes    IN-2015-JH158207-42140       Oceania
4      Yes    IN-2014-LC168857-41747       Oceania

### Region filter

In [24]:
# That's like select count(region) from table group by region 
df['Region'].value_counts()

Western Europe       121
Central America      117
Oceania               78
Western US            72
Eastern US            69
Southeastern Asia     64
South America         61
Southern Asia         58
Southern Europe       55
Eastern Asia          53
Western Asia          50
Southern US           44
Northern Europe       43
Central US            42
Caribbean             31
Western Africa        29
North Africa          26
Eastern Europe        24
Eastern Africa        11
Southern Africa       11
Central Africa        10
Eastern Canada         5
Central Asia           4
Western Canada         1
Name: Region, dtype: int64

In [30]:
region_filter= df['Region']=='Western Europe'

In [33]:
region_filter.head(20)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7     False
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15    False
16    False
17     True
18     True
19    False
Name: Region, dtype: bool

#### How to get a data frame with just the value I want

In [35]:
# 1. Square brackets - Filter dataframe to get a df with
# only Western Europe region
df[region_filter].head()

   Returned                 Order ID          Region
6       Yes  ES-2015-RA1994545-42218  Western Europe
11      Yes   ES-2012-SC208458-41070  Western Europe
17      Yes  ES-2015-CC1210045-42182  Western Europe
18      Yes  ES-2015-MM1792045-42199  Western Europe
22      Yes  ES-2015-BB1154548-42336  Western Europe

In [39]:
# 2. Loc
df.loc[region_filter, :]

     Returned                 Order ID          Region
6         Yes  ES-2015-RA1994545-42218  Western Europe
11        Yes   ES-2012-SC208458-41070  Western Europe
17        Yes  ES-2015-CC1210045-42182  Western Europe
18        Yes  ES-2015-MM1792045-42199  Western Europe
22        Yes  ES-2015-BB1154548-42336  Western Europe
...       ...                      ...             ...
961       Yes  ES-2012-MZ1751545-41262  Western Europe
1004      Yes  ES-2015-LS1723045-42159  Western Europe
1013      Yes  ES-2013-ME1772545-41370  Western Europe
1028      Yes  IT-2014-DO1364591-41870  Western Europe
1029      Yes  ES-2013-BF1100591-41501  Western Europe

[121 rows x 3 columns]

In [40]:
region_df = df.loc[region_filter, :]

In [41]:
region_df

     Returned                 Order ID          Region
6         Yes  ES-2015-RA1994545-42218  Western Europe
11        Yes   ES-2012-SC208458-41070  Western Europe
17        Yes  ES-2015-CC1210045-42182  Western Europe
18        Yes  ES-2015-MM1792045-42199  Western Europe
22        Yes  ES-2015-BB1154548-42336  Western Europe
...       ...                      ...             ...
961       Yes  ES-2012-MZ1751545-41262  Western Europe
1004      Yes  ES-2015-LS1723045-42159  Western Europe
1013      Yes  ES-2013-ME1772545-41370  Western Europe
1028      Yes  IT-2014-DO1364591-41870  Western Europe
1029      Yes  ES-2013-BF1100591-41501  Western Europe

[121 rows x 3 columns]

### Returned filter

In [44]:
# the data is about products that were returned so all will say yes,
# but if we wanted to filter just for returns in a different data we
# would do the following:
df['Returned'].value_counts()

Yes    1079
Name: Returned, dtype: int64

In [45]:
returns_filter = df['Returned']== "Yes"

In [46]:
returned_df = df.loc[returns_filter, :]

### Combining Filters

Instead of overwriting the df with filter after filter to narrow down the date, the filters can be combined using ```loc``` to first apply region filter then the returns filter.

There are several Bitwise Logic Operators that can be used:

| Bitwise Logic Operator | Meaning |
| --- | --- |
| & | and |
| &#124; | or |
| ^ | exclusive or |
| ~ | not |

In [47]:
df.loc[region_filter & returns_filter, :]

     Returned                 Order ID          Region
6         Yes  ES-2015-RA1994545-42218  Western Europe
11        Yes   ES-2012-SC208458-41070  Western Europe
17        Yes  ES-2015-CC1210045-42182  Western Europe
18        Yes  ES-2015-MM1792045-42199  Western Europe
22        Yes  ES-2015-BB1154548-42336  Western Europe
...       ...                      ...             ...
961       Yes  ES-2012-MZ1751545-41262  Western Europe
1004      Yes  ES-2015-LS1723045-42159  Western Europe
1013      Yes  ES-2013-ME1772545-41370  Western Europe
1028      Yes  IT-2014-DO1364591-41870  Western Europe
1029      Yes  ES-2013-BF1100591-41501  Western Europe

[121 rows x 3 columns]

## Renaming and deleting columns

### Rename columns

Two ways:

1. **dictionary substition**: good for renaming few columns
2. **list replacement**: requires a full list of names (more error prone)

In [49]:
df.head()

  Returned                  Order ID        Region
0      Yes  CA-2012-SA20830140-41210    Central US
1      Yes  IN-2012-PB19210127-41259  Eastern Asia
2      Yes  CA-2012-SC20095140-41174    Central US
3      Yes    IN-2015-JH158207-42140       Oceania
4      Yes    IN-2014-LC168857-41747       Oceania

In [50]:
# Approach 1 dictionary substition
df = df.rename(columns={'Order ID':'Order_ID'})

In [51]:
df.head()

  Returned                  Order_ID        Region
0      Yes  CA-2012-SA20830140-41210    Central US
1      Yes  IN-2012-PB19210127-41259  Eastern Asia
2      Yes  CA-2012-SC20095140-41174    Central US
3      Yes    IN-2015-JH158207-42140       Oceania
4      Yes    IN-2014-LC168857-41747       Oceania

In [53]:
# Approach 2 list replacement - need to list all columns
df.columns = ['returned',
             'order_id',
             'region']

In [54]:
df.head()

  returned                  order_id        region
0      Yes  CA-2012-SA20830140-41210    Central US
1      Yes  IN-2012-PB19210127-41259  Eastern Asia
2      Yes  CA-2012-SC20095140-41174    Central US
3      Yes    IN-2015-JH158207-42140       Oceania
4      Yes    IN-2014-LC168857-41747       Oceania

### Deleting columns

In [ ]:
# Approach 1 df.drop
# Multiple columns can be dropped
df =  df.drop(columns=['country'])

In [ ]:
# Approach 2 del command
del df['country']

## Aggregate functions

| Aggregate Method | Description |
| ---------------- | ----------- |
| sum | sum of values |
| cumsum | cumulative sum |
| mean | mean of values |
| median | arithmetic median of values |
| min | minimum |
| max | maximum |
| mode | mode |
| std | unbiased standard deviation |
| var | unbiased variance |
| quantile | computer rank-based statistics of elements |

### Sum

1. Sum in a column: ```df['column'].sum()```
2. Sum values across all columns (value for each column shown, including strings): ```df.sum()```